{
    "format": "layers-model",
    "generatedBy": "keras v2.11.0",
    "convertedBy": "TensorFlow.js Converter v4.2.0",
    "modelTopology": {
        "keras_version": "2.11.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_2",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                96,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "flatten_2_input"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_2",
                            "trainable": true,
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                96,
                                1
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_4",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 224,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.000844231341034174
                                }
                            },
                            "bias_regularizer": {
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 0.4996034801006317
                                }
                            },
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_5",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "binary_crossentropy",
            "metrics": [
                [
                    {
                        "class_name": "AUC",
                        "config": {
                            "name": "auc",
                            "dtype": "float32",
                            "num_thresholds": 200,
                            "curve": "ROC",
                            "summation_method": "interpolation",
                            "multi_label": false,
                            "num_labels": null,
                            "label_weights": null,
                            "from_logits": false
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Addons>AdamW",
                "config": {
                    "name": "AdamW",
                    "learning_rate": 0.014405369758605957,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false,
                    "weight_decay": 0.008844031020998955,
                    "exclude_from_weight_decay": null
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_4/kernel",
                    "shape": [
                        96,
                        224
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_4/bias",
                    "shape": [
                        224
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_5/kernel",
                    "shape": [
                        224,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_5/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}